ETL/Documents/ДанныеПоКонсолидации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ДанныеПоКонсолидации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДанныеПоКонсолидации</xr:Item>
				<xr:Item>InformationRegister.СведенияПоКонсолидации</xr:Item>
				<xr:Item>InformationRegister.ДвиженияПоДаннымПоКонсолидации</xr:Item>
				<xr:Item>InformationRegister.ДвиженияПоКонсолидации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрагентыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВГруппу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субхолдинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субхолдинги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВладения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаТранзакции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаТранзакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаТранзакцииВТенге</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыУчетаКонсолидации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МетодУчетаКонсодидации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МетодыУчетаКонсолидации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериметрКонсолидации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПериметрыКонсолидации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ETL/InformationRegisters/ДвиженияПоДаннымПоКонсолидации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДвиженияПоДаннымПоКонсолидации</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрагентыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВходитВГруппу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субхолдинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субхолдинги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентВладения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаТранзакции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаТранзакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаТранзакцииВТенге</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МетодУчетаКонсодидации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МетодыУчетаКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериметрКонсолидации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериметрыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/InformationRegisters/ДанныеПоКонсолидации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПоКонсолидации</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентВладения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаТранзакции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаТранзакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаТранзакцииВТенге</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрагентыКонсолидации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВходитВГруппу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субхолдинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субхолдинги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БуквенныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлассификатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьКурсИзИнтернета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Documents/ДанныеПоКонсолидации/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Результат = ПолучитьЗначения_ID_из_SQL_по_GUID();
	
	IDОрганизации 	= ПолучитьIDСправочника(Организация,"map_Organizations",Результат); 
	
    guidДокумента 	= Строка(Ссылка.УникальныйИдентификатор());
    НаимДокумента 	= Строка(Ссылка);
	KZT = Справочники.Валюты.НайтиПоРеквизиту("КодКлассификатора","398");
	
	Движения.ДвиженияПоДаннымПоКонсолидации.Записывать = Истина;
	Движения.ДанныеПоКонсолидации.Записывать = Истина;
	Для Каждого ТекСтрокаМетодыУчетаКонсолидации Из МетодыУчетаКонсолидации Цикл
		Движение 					= Движения.ДвиженияПоДаннымПоКонсолидации.Добавить();
		Движение.Период 			= Дата;
		Движение.ВидОперации 		= ВидОперации;
		Движение.Организация 		= Организация;
		Движение.Контрагент 		= Контрагент;
		Движение.ВходитВГруппу 		= ВходитВГруппу;
		Движение.Субхолдинг 		= Субхолдинг;
		Движение.ПроцентВладения 	= ПроцентВладения;
		Движение.ВалютаТранзакции 	= ВалютаТранзакции;
		Движение.СуммаТранзакции 	= СуммаТранзакции;
		Движение.СуммаТранзакцииВТенге = СуммаТранзакцииВТенге;
		Движение.Комментарий 		= Комментарий;
		Движение.МетодУчетаКонсодидации = ТекСтрокаМетодыУчетаКонсолидации.МетодУчетаКонсодидации;
		Движение.ПериметрКонсолидации 	= ТекСтрокаМетодыУчетаКонсолидации.ПериметрКонсолидации;
		
		ТекстЗапросаЗаписи = "INSERT INTO [dbo].[map_ConsolidationData_Movements]
		|           ([Period]
		|			,[company]
		|			,[OperationType]
		|           ,[Counterparty]
		|           ,[CounterpartyIIN]
		|           ,[BelongsToTheGroup]
		|           ,[Subholding]
		|           ,[OwnershipPercentage]
		|           ,[Currency]
		|           ,[CurrencyAmount]
		|           ,[RegulatedAmount]
		|           ,[ConsolidationMethod]
		|           ,[ConsolidationPerimeter]
		|           ,[Recorder]
		|           ,[RecorderGUID])
		|     VALUES
		|           (N'"+Формат(Дата,"ДФ='yyyyMMdd'")+"'
		|			,'"+IDОрганизации+"'
		|           ,'"+СокрЛП(ВидОперации)+"'
		|           ,'"+СокрЛП(Контрагент)+"'
		|           ,'"+СокрЛП(Контрагент.ИИН)+"'
		|           ,'"+?(ВходитВГруппу ,1,0)+"'
		|           ,'"+ПолучитьIDСправочника(Субхолдинг,"map_Subholdings",Результат)+"'
		|           ,'"+УдалитьПробелы(ПроцентВладения)+"'
		|           ,'"+ИнтеграцияДЗО.ПолучитьIDВалюты(ВалютаТранзакции.КодСправочника)+"'
		|           ,'"+УдалитьПробелы(СуммаТранзакции)+"'
		|           ,'"+УдалитьПробелы(СуммаТранзакцииВТенге)+"'
		|           ,'"+ТекСтрокаМетодыУчетаКонсолидации.МетодУчетаКонсодидации+"'
		|           ,'"+ПолучитьIDСправочника(ТекСтрокаМетодыУчетаКонсолидации.ПериметрКонсолидации,"map_ConsolidationPerimeters",Результат)+"'
		|           ,'"+НаимДокумента +"'
		|			,'"+guidДокумента +"')";
		Отказ = ИнтеграцияДЗО.ВыполнитьИнструкциюЗаписи(ТекстЗапросаЗаписи);
		
	КонецЦикла;
	
	Движение 					= Движения.ДанныеПоКонсолидации.Добавить();
	Движение.Период 			= Дата;
	Движение.Организация 		= Организация;
	Движение.Контрагент 		= Контрагент;
	Движение.ВходитВГруппу 		= ВходитВГруппу;
	Движение.Субхолдинг 		= Субхолдинг;
	Движение.ПроцентВладения 	= ПроцентВладения;
	Движение.ВалютаТранзакции 	= ВалютаТранзакции;
	Движение.СуммаТранзакции 	= СуммаТранзакции;
	Движение.СуммаТранзакцииВТенге = СуммаТранзакцииВТенге;
	

	ТекстЗапросаЗаписи = "INSERT INTO [dbo].[map_ConsolidationData]
	|           ([Period]
	|			,[company]
	|           ,[Counterparty]
	|           ,[CounterpartyIIN]
	|           ,[BelongsToTheGroup]
	|           ,[Subholding]
	|           ,[OwnershipPercentage]
	|           ,[Currency]
	|           ,[CurrencyAmount]
	|           ,[RegulatedAmount]
	|           ,[Recorder]
	|           ,[RecorderGUID])
	|     VALUES
	|           (N'"+Формат(Дата,"ДФ='yyyyMMdd'")+"'
	|			,'"+IDОрганизации+"'
	|           ,'"+СокрЛП(Контрагент)+"'
	|           ,'"+СокрЛП(Контрагент.ИИН)+"'
	|           ,'"+?(ВходитВГруппу ,1,0)+"'
	|           ,'"+ПолучитьIDСправочника(Субхолдинг,"map_Subholdings",Результат)+"'
	|           ,'"+УдалитьПробелы(ПроцентВладения)+"'
	|           ,'"+ИнтеграцияДЗО.ПолучитьIDВалюты(ВалютаТранзакции.КодСправочника)+"'
	|           ,'"+УдалитьПробелы(СуммаТранзакции)+"'
	|           ,'"+УдалитьПробелы(СуммаТранзакцииВТенге)+"'
	|           ,'"+НаимДокумента+"'
	|			,'"+guidДокумента+"')";
	Отказ = ИнтеграцияДЗО.ВыполнитьИнструкциюЗаписи(ТекстЗапросаЗаписи);
	
	Если Отказ Тогда
		УдалитьЗаписиSQL();
	КонецЕсли;
	
	
КонецПроцедуры 



Функция ПолучитьЗначения_ID_из_SQL_по_GUID()
	Массив = Новый Массив;
	Массив.Добавить("map_Organizations");
	Массив.Добавить("map_ConsolidationPerimeters");
	Массив.Добавить("map_Subholdings");
	
	Возврат ИнтеграцияДЗО.ПолучитьЗначения_ID_из_SQL_по_GUID(Массив);
	
КонецФункции
 
Функция ПреобразоватьОбъектВЗначение(ОбъектПреобразования, ЕслиNull = "") Экспорт
	
	Если ОбъектПреобразования = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	ТипЗначения = ТипЗнч(ОбъектПреобразования);
	Если ТипЗначения = Тип("Дата") Тогда
		Значение = Формат(ОбъектПреобразования, "ДФ = гггг-ММ-дд");
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Значение = Формат(ОбъектПреобразования, "ЧГ=0;ЧН=0;ЧРД=.;ЧДЦ=2");
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Если ОбъектПреобразования = Истина Тогда
			Значение = "1";
		Иначе
			Значение = "0";
		КонецЕсли;
	ИначеЕсли ОбъектПреобразования = NULL Тогда
		Значение = ЕслиNull;
	Иначе
		Значение = XMLСтрока(СокрЛП(ОбъектПреобразования));	
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьID(Ссылка, Таблица)  Экспорт
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Результат = "0";
		Возврат Результат; 
	КонецЕсли;	
	
	НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();
	
	Соединение  = Новый COMОбъект("ADODB.Connection");	
	Соединение.ConnectionString = "DRIVER={SQL Server};" + "SERVER=" + НастройкиОбмена.ИнстансSQL + ";" + "UID=" + НастройкиОбмена.ЛогинSQL + ";" + "PWD=" + НастройкиОбмена.ПарольSQL +";" + "DATABASE=" + НастройкиОбмена.БазаДанныхSQL + ";";
	Соединение.CommandTimeout	 = 600;
	Соединение.ConnectionTimeout = 180;
	Соединение.Open();
	
	Выборка     = Новый COMОбъект("ADODB.RecordSet");
	Выборка.CursorType = 3;
	Выборка.ActiveConnection = Соединение;
	Выборка.Open("Select id from " + Таблица + " where GUID = '" + XMLСтрока(Ссылка) + "'");
	Выборка.MoveFirst(); 
	Если Выборка.EOF() = 0 Тогда
		Результат = Выборка.Fields("id").Value;
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Выборка.Close();
	Соединение.Close();  
	
	Возврат Результат; 
	
КонецФункции

Функция УдалитьПробелы(ТекЧисло)
	
	Возврат ИнтеграцияДЗО.УдалитьПробелы(ТекЧисло);	
	//
	//Если ЗначениеЗаполнено(ТекЧисло) Тогда
	//	Возврат Формат(ТекЧисло,"ЧГ=");
	//Иначе
	//	Возврат "0";
	//КонецЕсли;
	
КонецФункции // УдалитьПробелы¶()

&НаСервере
Функция ПолучитьIDСправочника(Ссылка,ИмяТаблицы,ДанныеSQL)
	
	Если ТипЗнч(Ссылка) = Тип("Строка") Тогда
		GUID = Ссылка;
	Иначе 
		Если ЗначениеЗаполнено(Ссылка)Тогда
			GUID = XMLСтрока(Ссылка); 
		Иначе 
			Возврат 0;
		КонецЕсли;
		
	КонецЕсли;
	
	ТЗ = ДанныеSQL[ИмяТаблицы];
	Результат = ДанныеSQL[ИмяТаблицы].Найти(GUID,"GUID");
	Если Результат <> Неопределено Тогда
		Возврат Результат.ID;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции // ПолучитьIDСправочника()

&НаСервере
Функция ПолучитьIDКонтрагента(ИИН)
	
	ID = ИнтеграцияДЗО.ПолучитьIDКонтрагентаПоИИН(ИИН);	
	Возврат ID; 
	
КонецФункции // ПолучитьIDКонтрагента()

Функция Соединение() Экспорт
	
	НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();
	
	Попытка
		
		Команда     = Новый COMОбъект("ADODB.Command");
		Выборка     = Новый COMОбъект("ADODB.RecordSet");
		Соединение  = Новый COMОбъект("ADODB.Connection");
		
		Соединение.ConnectionString = "DRIVER={SQL Server};" + "SERVER=" + НастройкиОбмена.ИнстансSQL + ";" + "UID=" + НастройкиОбмена.ЛогинSQL + ";" + "PWD=" + НастройкиОбмена.ПарольSQL +";" + "DATABASE=" + НастройкиОбмена.БазаДанныхSQL + ";";
		
		Соединение.CommandTimeout	 = 1800;
		Соединение.ConnectionTimeout = 1800;
		
		Соединение.Open();
		
		Команда.ActiveConnection = Соединение;
		
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Выборка SQL", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат Команда;
	
КонецФункции

Процедура УдалитьЗаписиSQL()

	Результат = ПолучитьЗначения_ID_из_SQL_по_GUID();
	
	IDОрганизации =ПолучитьIDСправочника(Организация,"map_Organizations",Результат); 

	ТекстЗапросаУдаления = "DELETE  FROM map_ConsolidationData 
	|WHERE RecorderGUID = '"+Строка(Ссылка.УникальныйИдентификатор())+"'";
	Ответ = ИнтеграцияДЗО.ВыполнитьИнструкциюУдаления(ТекстЗапросаУдаления);
	
	ТекстЗапросаУдаления = "DELETE  FROM map_ConsolidationData_Movements 
	|WHERE RecorderGUID = '"+Строка(Ссылка.УникальныйИдентификатор())+"'";
	Ответ = ИнтеграцияДЗО.ВыполнитьИнструкциюУдаления(ТекстЗапросаУдаления);
	
КонецПроцедуры	


Процедура ОбработкаУдаленияПроведения(Отказ)
	УдалитьЗаписиSQL();
КонецПроцедуры
